# შექმენი სია, რომელიც შეიცავს 10 განსხვავებულ მანქანის სახელს
cars = ["BMW", "Audi", "Mercedes", "Tesla", "Honda", "Toyota", "Ford", "Chevrolet", "Nissan", "Kia"]

# დაბეჭდეთ მეორე და მეხუთე ელემენტები
print(":", cars[1])
print(":", cars[4])

# დაბეჭდეთ თავიდან შუამდე ყველა ელემენტი
print(":", cars[:5])

# დაბეჭდეთ შუიდან ბოლომდე ყველა ელემენტი
print(":", cars[5:])

# დაბეჭდეთ მინუს 3 ინდექსზე და -1 ინდექსზე მდგომი ელემენტები
print(":", cars[-3])
print(":", cars[-1])

# დაბეჭდეთ შუა სამი ელემენტი
print(":", cars[3:6])

# დაბეჭდეთ მთლიანი სია
print(":", cars)


