# Frontend დეველოპერი
- #UI
- #UX
- #HTML
- #CSS
- #JavaScript
- #ვიზუალური_ნაწილები
- #ვებ_დიზაინი
- #მომხმარებლის_ინტერფეისი

Frontend დეველოპერი მუშაობს იმ ნაწილზე, რომელსაც მომხმარებელი უშუალოდ ხედავს და ურთიერთობს, ანუ ვებსაიტის ვიზუალური ნაწილი. აქ შედის:
- დიზაინის ელემენტების კოდი: HTML, CSS და JavaScript;
- ვიზუალური ეფექტები და ანიმაციები;
- მომხმარებელთან ინტერაქცია და რეაგირება (მაგ. ღილაკების დაჭერისას);
- ყურადღება ექცევა გვერდის ოპტიმიზაციას და გამოყენებადობას.

---

# Backend დეველოპერი
- #სერვერული_კოდი
- #მონაცემთა_ბაზები
- #API
- #უსაფრთხოება
- #სერვერის_ოპტიმიზაცია
- #დაცულობა

Backend დეველოპერი პასუხისმგებელია იმ ნაწილზე, რომელიც მომხმარებლისთვის უხილავია, ანუ ვებსაიტის სერვერებზე. მათი ამოცანებია:
- სერვერის კოდი და მონაცემთა ბაზები, რომელთა საშუალებითაც ინახება ინფორმაცია;
- API-ების შექმნა, რომლებიც frontend-ს უკავშირდება;
- უსაფრთხოებისა და მონაცემთა დაცულობის უზრუნველყოფა;
- სერვერის ოპტიმიზაცია და მისი ფუნქციონალურობა.

---

# Fullstack დეველოპერი
- #Frontend
- #Backend
- #სრული_პროექტი
- #მრავალმხრივი_დეველოპმენტი
- #პროექტის_შეერთება

Fullstack დეველოპერი იცნობს და ფლობს როგორც frontend-ს, ასევე backend-ს. ის მუშაობს როგორც ვებსაიტის ვიზუალურ მხარეს, ისე მის სერვერულ ნაწილზე. Fullstack დეველოპერებს ხშირად უფრო მეტი პასუხისმგებლობა აკისრია, რადგან მათ ორი მიმართულებით უწევთ ცოდნის გამოყენება, რაც კომპლექსურ პროექტებზე მუშაობას უადვილებს.



