# სია, რომელიც შეიცავს 5 ცხოველის სახელს
animals = ["ლომი", "ვეფხვი", "გველფოტა", "სპილო", "მგელი"]

# პირველი და ბოლო ცხოველის სახელების გამოყვანა ინდექსების გამოყენებით
first_animal = animals[0]
last_animal = animals[-1]

print(f"პირველი ცხოველი: {lion}")
print(f"ბოლო ცხოველი: {wolf}")


# სია, რომელიც შეიცავს 10 რიცხვს
numbers = [3, 8, 15, 22, 27, 31, 42, 58, 63, 77]

# სიის პირველი 5 ელემენტის გამოყვანა
first_five = numbers[:5]

# სიის ბოლო 5 ელემენტის გამოყვანა
last_five = numbers[-5:]

print(f"პირველი 5 ელემენტი: {first_five}")
print(f"ბოლო 5 ელემენტი: {last_five}")
